Расширения/ИнтеграцияITOkna/DataProcessors/ЖурналДокументовПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЖурналДокументовПроизводства</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Расширения/ИнтеграцияITOkna/Documents/ПроизводствоБезЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводствоБезЗаказа</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдЗаказаITOkna</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппировкаЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппировкиЗатратВПроизводствеБезЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МатериалыИРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяКалькуляции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГруппыЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыходныеИзделия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Получатель</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НаправлениеВыпуска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГруппыЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Расширения/ИнтеграцияITOkna/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкидкиРассчитаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдЗаказаITOkna</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Расширения/ИнтеграцияITOkna/DataProcessors/ЖурналДокументовПроизводства/Forms/СписокДокументов/Ext/Form/Module.bsl
&НаСервере
Процедура IT_Okna_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Попытка
		СписокДокументыПроизводства.ТекстЗапроса = ТекстЗапросаСписка();
		
		НовыйЭлемент  = Элементы.Добавить("СписокДокументыПроизводстваЗаказ", Тип("ПолеФормы"), Элементы.СписокДокументыПроизводства);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
		НовыйЭлемент.ПутьКДанным = "СписокДокументыПроизводства.Заказ";;
	Исключение
	КонецПопытки;
	//Сообщить(СписокДокументыПроизводства.ТекстЗапроса);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстЗапросаСписка()
	
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ВЫБОР
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.АктВыполненныхВнутреннихРабот
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.АктВыполненныхВнутреннихРабот)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ДвижениеПродукцииИМатериалов)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ПроизводствоБезЗаказа
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ПроизводствоБезЗаказа)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеВозвратныхОтходов
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеВозвратныхОтходов)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеПроизводственныхЗатрат
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеПроизводственныхЗатрат)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеПрочихЗатрат
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеПрочихЗатрат)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ВыработкаСотрудников
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ВыработкаСотрудников)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.Сторно
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.Сторно)
	        |	КОНЕЦ КАК Ссылка,
	        |	РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	        |	РеестрДокументовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	        |	РеестрДокументовПереопределяемый.НомерДокументаИБ КАК Номер,
	        |	РеестрДокументовПереопределяемый.ДатаДокументаИБ КАК Дата,
	        |	РеестрДокументовПереопределяемый.Организация КАК Организация,
	        |	РеестрДокументовПереопределяемый.Подразделение КАК Подразделение,
	        |	ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.МестоХранения.Ключ КАК Справочник.Склады) КАК Склад,
	        |	РеестрДокументовПереопределяемый.Ответственный КАК Менеджер,
	        |	РеестрДокументовПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	        |	СостоянияЭДПереопределяемый.ПредставлениеСостояния КАК ПредставлениеСостояния,
	        |	РеестрДокументовПереопределяемый.НаправлениеДеятельности КАК НаправлениеДеятельности,
	        |	РеестрДокументовПереопределяемый.Статус КАК Статус,
	        |	РеестрДокументовПереопределяемый.Дополнительно КАК Дополнительно,
	        |	РеестрДокументовПереопределяемый.Комментарий КАК Комментарий,
	        |	РеестрДокументовПереопределяемый.НомерПервичногоДокумента КАК НомерВходящегоДокумента,
	        |	РеестрДокументовПереопределяемый.ДатаПервичногоДокумента КАК ДатаВходящегоДокумента,
	        |	ВЫБОР
	        |		КОГДА РеестрДокументовПереопределяемый.Проведен
	        |			ТОГДА 0
	        |		КОГДА РеестрДокументовПереопределяемый.ПометкаУдаления
	        |			ТОГДА 1
	        |		ИНАЧЕ 2
	        |	КОНЕЦ КАК НестандартнаяКартинка,
	        |	РеестрДокументовПереопределяемый.ДополнительнаяЗапись КАК ДополнительнаяЗапись,
	        |	РеестрДокументовПереопределяемый.ТипСсылки КАК ТипСсылки,
	        |	ЕСТЬNULL(СтатусыПроверки.СтатусПроверки, ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиФинансовыхДокументов.ПустаяСсылка)) КАК СтатусПроверки,
	        |	ТИПЗНАЧЕНИЯ(РеестрДокументовПереопределяемый.Ссылка) КАК ТипЗначения,
	        |	РеестрДокументовПереопределяемый.СторноИсправление КАК СторноИсправление,
	        |	ВЫБОР
	        |		КОГДА НЕ РеестрДокументовПереопределяемый.СторноИсправление
	        |			ТОГДА НЕОПРЕДЕЛЕНО
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА РеестрДокументовПереопределяемый.СторнируемыйДокумент ССЫЛКА Документ.АктВыполненныхВнутреннихРабот
	        |					ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.СторнируемыйДокумент КАК Документ.АктВыполненныхВнутреннихРабот)
	        |				КОГДА РеестрДокументовПереопределяемый.СторнируемыйДокумент ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	        |					ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.СторнируемыйДокумент КАК Документ.ДвижениеПродукцииИМатериалов)
	        |				КОГДА РеестрДокументовПереопределяемый.СторнируемыйДокумент ССЫЛКА Документ.ПроизводствоБезЗаказа
	        |					ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.СторнируемыйДокумент КАК Документ.ПроизводствоБезЗаказа)
	        |				КОГДА РеестрДокументовПереопределяемый.СторнируемыйДокумент ССЫЛКА Документ.РаспределениеВозвратныхОтходов
	        |					ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.СторнируемыйДокумент КАК Документ.РаспределениеВозвратныхОтходов)
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СторнируемыйИсправляемыйДокумент,
	        |	РеестрДокументовПереопределяемый.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	        |	ЕСТЬNULL(ЗаказКлиента.Ссылка, НЕОПРЕДЕЛЕНО) КАК Заказ
	        |ИЗ
	        |	РегистрСведений.РеестрДокументов КАК РеестрДокументовПереопределяемый
	        |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПроверкиДокументов КАК СтатусыПроверки
	        |		ПО РеестрДокументовПереопределяемый.Организация = СтатусыПроверки.Организация
	        |			И РеестрДокументовПереопределяемый.Ссылка = СтатусыПроверки.Документ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭДПереопределяемый
	        |		ПО (СостоянияЭДПереопределяемый.СсылкаНаОбъект = РеестрДокументовПереопределяемый.Ссылка)}
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	        |		ПО (ВЫБОР
	        |				КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ПроизводствоБезЗаказа
	        |					ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ПроизводствоБезЗаказа).ИдЗаказаITOkna = ЗаказКлиента.ИдЗаказаITOkna
	        |							И ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ПроизводствоБезЗаказа).ИдЗаказаITOkna <> 0
	        |				ИНАЧЕ ЛОЖЬ
	        |			КОНЕЦ)
	        |{ГДЕ
	        |	(ВЫБОР
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.АктВыполненныхВнутреннихРабот
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.АктВыполненныхВнутреннихРабот)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ДвижениеПродукцииИМатериалов)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ПроизводствоБезЗаказа
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ПроизводствоБезЗаказа)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеВозвратныхОтходов
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеВозвратныхОтходов)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеПроизводственныхЗатрат
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеПроизводственныхЗатрат)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеПрочихЗатрат
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеПрочихЗатрат)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ВыработкаСотрудников
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ВыработкаСотрудников)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.Сторно
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.Сторно)
	        |		КОНЕЦ).* КАК Ссылка,
	        |	РеестрДокументовПереопределяемый.Организация.* КАК Организация,
	        |	РеестрДокументовПереопределяемый.ДатаДокументаИБ КАК Дата,
	        |	РеестрДокументовПереопределяемый.НомерДокументаИБ КАК Номер,
	        |	РеестрДокументовПереопределяемый.Статус КАК Статус,
	        |	РеестрДокументовПереопределяемый.ТипСсылки КАК ТипСсылки,
	        |	РеестрДокументовПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	        |	РеестрДокументовПереопределяемый.Подразделение.* КАК Подразделение,
	        |	РеестрДокументовПереопределяемый.Ответственный.* КАК Менеджер,
	        |	РеестрДокументовПереопределяемый.Дополнительно КАК Дополнительно,
	        |	РеестрДокументовПереопределяемый.Комментарий КАК Комментарий,
	        |	РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	        |	РеестрДокументовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	        |	(РеестрДокументовПереопределяемый.ДатаДокументаИБ >= &НачалоПериода
	        |			И РеестрДокументовПереопределяемый.ДатаДокументаИБ <= &КонецПериода) КАК Поле2}";
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("СписокДокументыПроизводстваВыбор")
Процедура IT_Okna_СписокДокументыПроизводстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОбщегоНазначенияУТКлиент.ИзменитьЭлемент(Элемент);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	Если Поле = Элементы.ПредставлениеСостояния Тогда
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаСписка(Элемент.ТекущиеДанные.Ссылка, СтандартнаяОбработка);
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
    #Вставка
	Если Поле = Элементы["СписокДокументыПроизводстваЗаказ"] Тогда
		ЗаказСсылка = Элемент.ТекущиеДанные.Заказ;
		Если ЗначениеЗаполнено(ЗаказСсылка) Тогда
			ПоказатьЗначение(Неопределено, ЗаказСсылка);
		КонецЕсли;	
	КонецЕсли;
	#КонецВставки
КонецПроцедуры
